[
    {"word": "acceleration", "tip": "Process of increasing speed."},
    {"word": "benevolence", "tip": "Quality of being well meaning and kind."},
    {"word": "controversy", "tip": "A prolonged public disagreement."},
    {"word": "determination", "tip": "Firmness of purpose."},
    {"word": "enchantment", "tip": "A feeling of great pleasure; magical."},
    {"word": "fluctuation", "tip": "An irregular rising and falling in number or amount."},
    {"word": "grandiosity", "tip": "Quality of being magnificent or splendid."},
    {"word": "hypothesis", "tip": "A proposed explanation made on the basis of limited evidence."},
    {"word": "integrity", "tip": "The quality of being honest and having strong moral principles."},
    {"word": "juxtaposition", "tip": "Fact of two things being seen or placed close together with contrasting effect."},
    {"word": "kinetic", "tip": "Relating to or resulting from motion."},
    {"word": "longitude", "tip": "Geographic coordinate that specifies the east-west position of a point on the Earth's surface."},
    {"word": "meticulous", "tip": "Showing great attention to detail; very careful and precise."},
    {"word": "nostalgia", "tip": "Sentimentality for the past, typically for a period or place with happy personal associations."},
    {"word": "optimization", "tip": "Process of making something as fully perfect, functional, or effective as possible."},
    {"word": "perception", "tip": "The ability to see, hear, or become aware of something through the senses."},
    {"word": "quarantine", "tip": "A state of isolation to prevent the spread of disease."},
    {"word": "resilience", "tip": "Capacity to recover quickly from difficulties."},
    {"word": "sustainability", "tip": "Avoidance of the depletion of natural resources to maintain ecological balance."},
    {"word": "translucent", "tip": "Allowing light, but not detailed shapes, to pass through."},
    {"word": "unification", "tip": "The process of being united or made into a whole."},
    {"word": "validation", "tip": "Recognition or affirmation that a person or their feelings or opinions are valid."},
    {"word": "wavelength", "tip": "The distance between successive crests of a wave, especially points in a sound wave or electromagnetic wave."},
    {"word": "xenogenesis", "tip": "The supposed generation of offspring completely and permanently different from the parent."},
    {"word": "yearning", "tip": "A feeling of intense longing for something."},
    {"word": "ambiguity", "tip": "The quality of being open to more than one interpretation; inexactness."},
    {"word": "biodegradable", "tip": "Capable of being decomposed by bacteria or other living organisms."},
    {"word": "cryptography", "tip": "The art of writing or solving codes."},
    {"word": "depreciation", "tip": "A reduction in the value of an asset over time."},
    {"word": "euphoria", "tip": "A feeling or state of intense excitement and happiness."},
    {"word": "flexibility", "tip": "The quality of bending easily without breaking."},
    {"word": "gregarious", "tip": "Fond of company; sociable."},
    {"word": "humility", "tip": "A modest or low view of one's own importance."},
    {"word": "innovation", "tip": "The action or process of innovating."},
    {"word": "jubilation", "tip": "A feeling of great happiness and triumph."},
    {"word": "keystone", "tip": "Something on which associated things depend."},
    {"word": "luminance", "tip": "The intensity of light emitted from a surface per unit area in a given direction."},
    {"word": "magnanimity", "tip": "The fact of being generous or forgiving, especially toward a rival or less powerful person."},
    {"word": "nebulous", "tip": "In the form of a cloud or haze; hazy."},
    {"word": "obfuscation", "tip": "The action of making something obscure, unclear, or unintelligible."},
    {"word": "polarization", "tip": "Division into two sharply contrasting groups or sets of opinions or beliefs."},
    {"word": "quintessence", "tip": "The most perfect or typical example of a quality or class."},
    {"word": "rejuvenation", "tip": "The action or process of making someone or something look or feel better, younger, or more vital."},
    {"word": "synthesis", "tip": "The combination of ideas to form a theory or system."},
    {"word": "therapeutic", "tip": "Relating to the healing of disease."},
    {"word": "ubiquity", "tip": "The state of being everywhere at once (or seeming to be everywhere at once)."},
    {"word": "vernacular", "tip": "The language or dialect spoken by the ordinary people in a particular country or region."},
    {"word": "wanderlust", "tip": "A strong desire to travel."},
    {"word": "exacerbate", "tip": "Make (a problem, bad situation, or negative feeling) worse."},
    {"word": "yield", "tip": "Produce or provide (a natural, agricultural, or industrial product)."}
  ]
  